outfits-project/app/controllers/outfits_controller.rb

  def index
    @outfits = Outfit.all
---
SELECT "outfits".* FROM "outfits"

  def create
    @outfit = Outfit.new(outfit_params)

    respond_to do |format|
      if @outfit.save
---
INSERT INTO "outfits" ("color", "created_at", "description", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @outfit.destroy
---
DELETE FROM "outfits" WHERE "outfits"."id" = ?  [["id", 3]]

    def set_outfit
      @outfit = Outfit.find(params[:id])
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT 1  [["id", "3"]]